; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Triangle_2D = type { i8, i8, i8, i8, i8, i8, i8 }
%struct.Triangle_3D = type { i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.CandidatePixel = type { i8, i8, i8, i8 }
%struct.Pixel = type { i8, i8, i8 }

@llvm.global_ctors = appending global [0 x { i32, void ()*, i8* }] zeroinitializer
@_ZZ8zcullingiP14CandidatePixeliP5PixelE8z_buffer = internal global [256 x [256 x i8]] zeroinitializer, align 1, !dbg !0

; Function Attrs: nounwind
define i32 @_Z15check_clockwise11Triangle_2D(%struct.Triangle_2D* byval align 1 %triangle_2d) #0 !dbg !43 {
entry:
  %cw = alloca i32, align 4
  call void @llvm.dbg.declare(metadata %struct.Triangle_2D* %triangle_2d, metadata !56, metadata !DIExpression()), !dbg !57
  %0 = bitcast i32* %cw to i8*, !dbg !58
  call void @llvm.lifetime.start.p0i8(i64 4, i8* %0) #15, !dbg !58
  call void @llvm.dbg.declare(metadata i32* %cw, metadata !59, metadata !DIExpression()), !dbg !60
  %x2 = getelementptr inbounds %struct.Triangle_2D, %struct.Triangle_2D* %triangle_2d, i32 0, i32 4, !dbg !61
  %1 = load i8, i8* %x2, align 1, !dbg !61
  %conv = zext i8 %1 to i32, !dbg !62
  %x0 = getelementptr inbounds %struct.Triangle_2D, %struct.Triangle_2D* %triangle_2d, i32 0, i32 0, !dbg !63
  %2 = load i8, i8* %x0, align 1, !dbg !63
  %conv1 = zext i8 %2 to i32, !dbg !64
  %sub = sub i32 %conv, %conv1, !dbg !65

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "z_buffer", scope: !2, file: !3, line: 196, type: !36, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "zculling", linkageName: "_Z8zcullingiP14CandidatePixeliP5Pixel", scope: !3, file: !3, line: 193, type: !4, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!3 = !DIFile(filename: "benchmarks/rosetta/3d-rendering/src/rendering.cpp", directory: "/home/gabriel/Documents/UFRGS/RAISE/AHLS")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7, !6, !18}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "CandidatePixel", file: !9, line: 57, baseType: !10)
!9 = !DIFile(filename: "benchmarks/rosetta/3d-rendering/src/typedefs.h", directory: "/home/gabriel/Documents/UFRGS/RAISE/AHLS")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 51, size: 32, flags: DIFlagTypePassByValue, elements: !11, identifier: "_ZTS14CandidatePixel")
!11 = !{!12, !15, !16, !17}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !10, file: !9, line: 53, baseType: !13, size: 8)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "bit8", file: !9, line: 21, baseType: !14)
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !10, file: !9, line: 54, baseType: !13, size: 8, offset: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !10, file: !9, line: 55, baseType: !13, size: 8, offset: 16)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !10, file: !9, line: 56, baseType: !13, size: 8, offset: 24)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", file: !9, line: 65, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 60, size: 24, flags: DIFlagTypePassByValue, elements: !21, identifier: "_ZTS5Pixel")
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !9, line: 62, baseType: !13, size: 8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !9, line: 63, baseType: !13, size: 8, offset: 8)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !9, line: 64, baseType: !13, size: 8, offset: 16)
!25 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !26, producer: "clang version 7.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !28)
!26 = !DIFile(filename: "/home/gabriel/Documents/UFRGS/RAISE/AHLS/vitis_projects/rendering_ahls/solution1/.autopilot/db/rendering.pp.0.cpp", directory: "/home/gabriel/Documents/UFRGS/RAISE/AHLS")
!27 = !{}
!28 = !{!0, !29, !32, !34}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!30 = distinct !DIGlobalVariable(name: "MAX_X", scope: !25, file: !9, line: 13, type: !31, isLocal: true, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!33 = distinct !DIGlobalVariable(name: "MAX_Y", scope: !25, file: !9, line: 14, type: !31, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression(DW_OP_constu, 3192, DW_OP_stack_value))
!35 = distinct !DIGlobalVariable(name: "NUM_3D_TRI", scope: !25, file: !9, line: 19, type: !31, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 524288, elements: !37)
!37 = !{!38, !38}
!38 = !DISubrange(count: 256)
!39 = !{!"clang version 7.0.0 "}
!40 = !{i32 2, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 4}
!43 = distinct !DISubprogram(name: "check_clockwise", linkageName: "_Z15check_clockwise11Triangle_2D", scope: !3, file: !3, line: 18, type: !44, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!44 = !DISubroutineType(types: !45)
!45 = !{!6, !46}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Triangle_2D", file: !9, line: 48, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 39, size: 56, flags: DIFlagTypePassByValue, elements: !48, identifier: "_ZTS11Triangle_2D")
!48 = !{!49, !50, !51, !52, !53, !54, !55}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !47, file: !9, line: 41, baseType: !13, size: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !47, file: !9, line: 42, baseType: !13, size: 8, offset: 8)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !47, file: !9, line: 43, baseType: !13, size: 8, offset: 16)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !47, file: !9, line: 44, baseType: !13, size: 8, offset: 24)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !47, file: !9, line: 45, baseType: !13, size: 8, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !47, file: !9, line: 46, baseType: !13, size: 8, offset: 40)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !47, file: !9, line: 47, baseType: !13, size: 8, offset: 48)
!56 = !DILocalVariable(name: "triangle_2d", arg: 1, scope: !43, file: !3, line: 18, type: !46)
!57 = !DILocation(line: 18, column: 33, scope: !43)
!58 = !DILocation(line: 20, column: 3, scope: !43)
!59 = !DILocalVariable(name: "cw", scope: !43, file: !3, line: 20, type: !6)
!60 = !DILocation(line: 20, column: 7, scope: !43)
!61 = !DILocation(line: 22, column: 21, scope: !43)
!62 = !DILocation(line: 22, column: 9, scope: !43)
!63 = !DILocation(line: 22, column: 38, scope: !43)
!64 = !DILocation(line: 22, column: 26, scope: !43)
!65 = !DILocation(line: 22, column: 24, scope: !43)
!66 = !DILocation(line: 22, column: 57, scope: !43)
!67 = !DILocation(line: 22, column: 45, scope: !43)
!68 = !DILocation(line: 22, column: 74, scope: !43)
!69 = !DILocation(line: 22, column: 62, scope: !43)
!70 = !DILocation(line: 22, column: 60, scope: !43)
!71 = !DILocation(line: 22, column: 42, scope: !43)
!72 = !DILocation(line: 23, column: 23, scope: !43)
!73 = !DILocation(line: 23, column: 11, scope: !43)
!74 = !DILocation(line: 23, column: 40, scope: !43)
!75 = !DILocation(line: 23, column: 28, scope: !43)
!76 = !DILocation(line: 23, column: 26, scope: !43)
!77 = !DILocation(line: 23, column: 59, scope: !43)
!78 = !DILocation(line: 23, column: 47, scope: !43)
!79 = !DILocation(line: 23, column: 76, scope: !43)
!80 = !DILocation(line: 23, column: 64, scope: !43)
!81 = !DILocation(line: 23, column: 62, scope: !43)
!82 = !DILocation(line: 23, column: 44, scope: !43)
!83 = !DILocation(line: 23, column: 8, scope: !43)
!84 = !DILocation(line: 22, column: 6, scope: !43)
!85 = !DILocation(line: 25, column: 10, scope: !43)
!86 = !DILocation(line: 27, column: 1, scope: !43)
!87 = !DILocation(line: 25, column: 3, scope: !43)
!88 = distinct !DISubprogram(name: "clockwise_vertices", linkageName: "_Z18clockwise_verticesP11Triangle_2D", scope: !3, file: !3, line: 30, type: !89, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!92 = !DILocalVariable(name: "triangle_2d", arg: 1, scope: !88, file: !3, line: 30, type: !91)
!93 = !DILocation(line: 30, column: 38, scope: !88)
!94 = !DILocation(line: 32, column: 3, scope: !88)
!95 = !DILocalVariable(name: "tmp_x", scope: !88, file: !3, line: 32, type: !13)
!96 = !DILocation(line: 32, column: 8, scope: !88)
!97 = !DILocalVariable(name: "tmp_y", scope: !88, file: !3, line: 32, type: !13)
!98 = !DILocation(line: 32, column: 15, scope: !88)
!99 = !DILocation(line: 34, column: 11, scope: !88)
!100 = !DILocation(line: 34, column: 24, scope: !88)
!101 = !DILocation(line: 34, column: 9, scope: !88)
!102 = !DILocation(line: 35, column: 11, scope: !88)
!103 = !DILocation(line: 35, column: 24, scope: !88)
!104 = !DILocation(line: 35, column: 9, scope: !88)
!105 = !DILocation(line: 37, column: 21, scope: !88)
!106 = !DILocation(line: 37, column: 34, scope: !88)
!107 = !DILocation(line: 37, column: 3, scope: !88)
!108 = !DILocation(line: 37, column: 16, scope: !88)
!109 = !DILocation(line: 37, column: 19, scope: !88)
!110 = !DILocation(line: 38, column: 21, scope: !88)
!111 = !DILocation(line: 38, column: 34, scope: !88)
!112 = !DILocation(line: 38, column: 3, scope: !88)
!113 = !DILocation(line: 38, column: 16, scope: !88)
!114 = !DILocation(line: 38, column: 19, scope: !88)
!115 = !DILocation(line: 40, column: 21, scope: !88)
!116 = !DILocation(line: 40, column: 3, scope: !88)
!117 = !DILocation(line: 40, column: 16, scope: !88)
!118 = !DILocation(line: 40, column: 19, scope: !88)
!119 = !DILocation(line: 41, column: 21, scope: !88)
!120 = !DILocation(line: 41, column: 3, scope: !88)
!121 = !DILocation(line: 41, column: 16, scope: !88)
!122 = !DILocation(line: 41, column: 19, scope: !88)
!123 = !DILocation(line: 42, column: 1, scope: !88)
!124 = distinct !DISubprogram(name: "pixel_in_triangle", linkageName: "_Z17pixel_in_trianglehh11Triangle_2D", scope: !3, file: !3, line: 48, type: !125, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !13, !13, !46}
!127 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!128 = !DILocalVariable(name: "x", arg: 1, scope: !124, file: !3, line: 48, type: !13)
!129 = !DILocation(line: 48, column: 29, scope: !124)
!130 = !DILocalVariable(name: "y", arg: 2, scope: !124, file: !3, line: 48, type: !13)
!131 = !DILocation(line: 48, column: 37, scope: !124)
!132 = !DILocalVariable(name: "triangle_2d", arg: 3, scope: !124, file: !3, line: 48, type: !46)
!133 = !DILocation(line: 48, column: 52, scope: !124)
!134 = !DILocation(line: 50, column: 3, scope: !124)
!135 = !DILocalVariable(name: "pi0", scope: !124, file: !3, line: 50, type: !6)
!136 = !DILocation(line: 50, column: 7, scope: !124)
!137 = !DILocalVariable(name: "pi1", scope: !124, file: !3, line: 50, type: !6)
!138 = !DILocation(line: 50, column: 12, scope: !124)
!139 = !DILocalVariable(name: "pi2", scope: !124, file: !3, line: 50, type: !6)
!140 = !DILocation(line: 50, column: 17, scope: !124)
!141 = !DILocation(line: 52, column: 10, scope: !124)
!142 = !DILocation(line: 52, column: 26, scope: !124)
!143 = !DILocation(line: 52, column: 14, scope: !124)
!144 = !DILocation(line: 52, column: 12, scope: !124)
!145 = !DILocation(line: 52, column: 45, scope: !124)
!146 = !DILocation(line: 52, column: 33, scope: !124)
!147 = !DILocation(line: 52, column: 62, scope: !124)
!148 = !DILocation(line: 52, column: 50, scope: !124)
!149 = !DILocation(line: 52, column: 48, scope: !124)
!150 = !DILocation(line: 52, column: 30, scope: !124)
!151 = !DILocation(line: 52, column: 69, scope: !124)
!152 = !DILocation(line: 52, column: 85, scope: !124)
!153 = !DILocation(line: 52, column: 73, scope: !124)
!154 = !DILocation(line: 52, column: 71, scope: !124)
!155 = !DILocation(line: 52, column: 104, scope: !124)
!156 = !DILocation(line: 52, column: 92, scope: !124)
!157 = !DILocation(line: 52, column: 121, scope: !124)
!158 = !DILocation(line: 52, column: 109, scope: !124)
!159 = !DILocation(line: 52, column: 107, scope: !124)
!160 = !DILocation(line: 52, column: 89, scope: !124)
!161 = !DILocation(line: 52, column: 66, scope: !124)
!162 = !DILocation(line: 52, column: 7, scope: !124)
!163 = !DILocation(line: 53, column: 10, scope: !124)
!164 = !DILocation(line: 53, column: 26, scope: !124)
!165 = !DILocation(line: 53, column: 14, scope: !124)
!166 = !DILocation(line: 53, column: 12, scope: !124)
!167 = !DILocation(line: 53, column: 45, scope: !124)
!168 = !DILocation(line: 53, column: 33, scope: !124)
!169 = !DILocation(line: 53, column: 62, scope: !124)
!170 = !DILocation(line: 53, column: 50, scope: !124)
!171 = !DILocation(line: 53, column: 48, scope: !124)
!172 = !DILocation(line: 53, column: 30, scope: !124)
!173 = !DILocation(line: 53, column: 69, scope: !124)
!174 = !DILocation(line: 53, column: 85, scope: !124)
!175 = !DILocation(line: 53, column: 73, scope: !124)
!176 = !DILocation(line: 53, column: 71, scope: !124)
!177 = !DILocation(line: 53, column: 104, scope: !124)
!178 = !DILocation(line: 53, column: 92, scope: !124)
!179 = !DILocation(line: 53, column: 121, scope: !124)
!180 = !DILocation(line: 53, column: 109, scope: !124)
!181 = !DILocation(line: 53, column: 107, scope: !124)
!182 = !DILocation(line: 53, column: 89, scope: !124)
!183 = !DILocation(line: 53, column: 66, scope: !124)
!184 = !DILocation(line: 53, column: 7, scope: !124)
!185 = !DILocation(line: 54, column: 10, scope: !124)
!186 = !DILocation(line: 54, column: 26, scope: !124)
!187 = !DILocation(line: 54, column: 14, scope: !124)
!188 = !DILocation(line: 54, column: 12, scope: !124)
!189 = !DILocation(line: 54, column: 45, scope: !124)
!190 = !DILocation(line: 54, column: 33, scope: !124)
!191 = !DILocation(line: 54, column: 62, scope: !124)
!192 = !DILocation(line: 54, column: 50, scope: !124)
!193 = !DILocation(line: 54, column: 48, scope: !124)
!194 = !DILocation(line: 54, column: 30, scope: !124)
!195 = !DILocation(line: 54, column: 69, scope: !124)
!196 = !DILocation(line: 54, column: 85, scope: !124)
!197 = !DILocation(line: 54, column: 73, scope: !124)
!198 = !DILocation(line: 54, column: 71, scope: !124)
!199 = !DILocation(line: 54, column: 104, scope: !124)
!200 = !DILocation(line: 54, column: 92, scope: !124)
!201 = !DILocation(line: 54, column: 121, scope: !124)
!202 = !DILocation(line: 54, column: 109, scope: !124)
!203 = !DILocation(line: 54, column: 107, scope: !124)
!204 = !DILocation(line: 54, column: 89, scope: !124)
!205 = !DILocation(line: 54, column: 66, scope: !124)
!206 = !DILocation(line: 54, column: 7, scope: !124)
!207 = !DILocation(line: 56, column: 11, scope: !124)
!208 = !DILocation(line: 56, column: 15, scope: !124)
!209 = !DILocation(line: 56, column: 20, scope: !124)
!210 = !DILocation(line: 56, column: 23, scope: !124)
!211 = !DILocation(line: 56, column: 27, scope: !124)
!212 = !DILocation(line: 56, column: 32, scope: !124)
!213 = !DILocation(line: 56, column: 35, scope: !124)
!214 = !DILocation(line: 56, column: 39, scope: !124)
!215 = !DILocation(line: 57, column: 1, scope: !124)
!216 = !DILocation(line: 56, column: 3, scope: !124)
!217 = distinct !DISubprogram(name: "find_min", linkageName: "_Z8find_minhhh", scope: !3, file: !3, line: 60, type: !218, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!218 = !DISubroutineType(types: !219)
!219 = !{!13, !13, !13, !13}
!220 = !DILocalVariable(name: "in0", arg: 1, scope: !217, file: !3, line: 60, type: !13)
!221 = !DILocation(line: 60, column: 20, scope: !217)
!222 = !DILocalVariable(name: "in1", arg: 2, scope: !217, file: !3, line: 60, type: !13)
!223 = !DILocation(line: 60, column: 30, scope: !217)
!224 = !DILocalVariable(name: "in2", arg: 3, scope: !217, file: !3, line: 60, type: !13)
!225 = !DILocation(line: 60, column: 40, scope: !217)
!226 = !DILocation(line: 62, column: 7, scope: !227)
!227 = distinct !DILexicalBlock(scope: !217, file: !3, line: 62, column: 7)
!228 = !DILocation(line: 62, column: 13, scope: !227)
!229 = !DILocation(line: 62, column: 11, scope: !227)
!230 = !DILocation(line: 62, column: 7, scope: !217)
!231 = !DILocation(line: 64, column: 9, scope: !232)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 64, column: 9)
!233 = distinct !DILexicalBlock(scope: !227, file: !3, line: 63, column: 3)
!234 = !DILocation(line: 64, column: 15, scope: !232)
!235 = !DILocation(line: 64, column: 13, scope: !232)
!236 = !DILocation(line: 64, column: 9, scope: !233)
!237 = !DILocation(line: 65, column: 14, scope: !232)
!238 = !DILocation(line: 65, column: 7, scope: !232)
!239 = !DILocation(line: 67, column: 14, scope: !232)
!240 = !DILocation(line: 67, column: 7, scope: !232)
!241 = !DILocation(line: 71, column: 9, scope: !242)
!242 = distinct !DILexicalBlock(scope: !243, file: !3, line: 71, column: 9)
!243 = distinct !DILexicalBlock(scope: !227, file: !3, line: 70, column: 3)
!244 = !DILocation(line: 71, column: 15, scope: !242)
!245 = !DILocation(line: 71, column: 13, scope: !242)
!246 = !DILocation(line: 71, column: 9, scope: !243)
!247 = !DILocation(line: 72, column: 14, scope: !242)
!248 = !DILocation(line: 72, column: 7, scope: !242)
!249 = !DILocation(line: 74, column: 14, scope: !242)
!250 = !DILocation(line: 74, column: 7, scope: !242)
!251 = !DILocation(line: 76, column: 1, scope: !217)
!252 = distinct !DISubprogram(name: "find_max", linkageName: "_Z8find_maxhhh", scope: !3, file: !3, line: 79, type: !218, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!253 = !DILocalVariable(name: "in0", arg: 1, scope: !252, file: !3, line: 79, type: !13)
!254 = !DILocation(line: 79, column: 20, scope: !252)
!255 = !DILocalVariable(name: "in1", arg: 2, scope: !252, file: !3, line: 79, type: !13)
!256 = !DILocation(line: 79, column: 30, scope: !252)
!257 = !DILocalVariable(name: "in2", arg: 3, scope: !252, file: !3, line: 79, type: !13)
!258 = !DILocation(line: 79, column: 40, scope: !252)
!259 = !DILocation(line: 81, column: 7, scope: !260)
!260 = distinct !DILexicalBlock(scope: !252, file: !3, line: 81, column: 7)
!261 = !DILocation(line: 81, column: 13, scope: !260)
!262 = !DILocation(line: 81, column: 11, scope: !260)
!263 = !DILocation(line: 81, column: 7, scope: !252)
!264 = !DILocation(line: 83, column: 9, scope: !265)
!265 = distinct !DILexicalBlock(scope: !266, file: !3, line: 83, column: 9)
!266 = distinct !DILexicalBlock(scope: !260, file: !3, line: 82, column: 3)
!267 = !DILocation(line: 83, column: 15, scope: !265)
!268 = !DILocation(line: 83, column: 13, scope: !265)
!269 = !DILocation(line: 83, column: 9, scope: !266)
!270 = !DILocation(line: 84, column: 14, scope: !265)
!271 = !DILocation(line: 84, column: 7, scope: !265)
!272 = !DILocation(line: 86, column: 14, scope: !265)
!273 = !DILocation(line: 86, column: 7, scope: !265)
!274 = !DILocation(line: 90, column: 9, scope: !275)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 90, column: 9)
!276 = distinct !DILexicalBlock(scope: !260, file: !3, line: 89, column: 3)
!277 = !DILocation(line: 90, column: 15, scope: !275)
!278 = !DILocation(line: 90, column: 13, scope: !275)
!279 = !DILocation(line: 90, column: 9, scope: !276)
!280 = !DILocation(line: 91, column: 14, scope: !275)
!281 = !DILocation(line: 91, column: 7, scope: !275)
!282 = !DILocation(line: 93, column: 14, scope: !275)
!283 = !DILocation(line: 93, column: 7, scope: !275)
!284 = !DILocation(line: 95, column: 1, scope: !252)
!285 = distinct !DISubprogram(name: "projection", linkageName: "_Z10projection11Triangle_3DP11Triangle_2Di", scope: !3, file: !3, line: 100, type: !286, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288, !91, !6}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "Triangle_3D", file: !9, line: 36, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 25, size: 72, flags: DIFlagTypePassByValue, elements: !290, identifier: "_ZTS11Triangle_3D")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !289, file: !9, line: 27, baseType: !13, size: 8)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !289, file: !9, line: 28, baseType: !13, size: 8, offset: 8)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "z0", scope: !289, file: !9, line: 29, baseType: !13, size: 8, offset: 16)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !289, file: !9, line: 30, baseType: !13, size: 8, offset: 24)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !289, file: !9, line: 31, baseType: !13, size: 8, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "z1", scope: !289, file: !9, line: 32, baseType: !13, size: 8, offset: 40)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !289, file: !9, line: 33, baseType: !13, size: 8, offset: 48)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !289, file: !9, line: 34, baseType: !13, size: 8, offset: 56)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "z2", scope: !289, file: !9, line: 35, baseType: !13, size: 8, offset: 64)
!300 = !DILocalVariable(name: "triangle_3d", arg: 1, scope: !285, file: !3, line: 100, type: !288)
!301 = !DILocation(line: 100, column: 29, scope: !285)
!302 = !DILocalVariable(name: "triangle_2d", arg: 2, scope: !285, file: !3, line: 100, type: !91)
!303 = !DILocation(line: 100, column: 55, scope: !285)
!304 = !DILocalVariable(name: "angle", arg: 3, scope: !285, file: !3, line: 100, type: !6)
!305 = !DILocation(line: 100, column: 72, scope: !285)
!306 = !DILocation(line: 106, column: 6, scope: !307)
!307 = distinct !DILexicalBlock(scope: !285, file: !3, line: 106, column: 6)
!308 = !DILocation(line: 106, column: 12, scope: !307)
!309 = !DILocation(line: 106, column: 6, scope: !285)
!310 = !DILocation(line: 108, column: 35, scope: !311)
!311 = distinct !DILexicalBlock(scope: !307, file: !3, line: 107, column: 3)
!312 = !DILocation(line: 108, column: 5, scope: !311)
!313 = !DILocation(line: 108, column: 18, scope: !311)
!314 = !DILocation(line: 108, column: 21, scope: !311)
!315 = !DILocation(line: 109, column: 35, scope: !311)
!316 = !DILocation(line: 109, column: 5, scope: !311)
!317 = !DILocation(line: 109, column: 18, scope: !311)
!318 = !DILocation(line: 109, column: 21, scope: !311)
!319 = !DILocation(line: 110, column: 35, scope: !311)
!320 = !DILocation(line: 110, column: 5, scope: !311)
!321 = !DILocation(line: 110, column: 18, scope: !311)
!322 = !DILocation(line: 110, column: 21, scope: !311)
!323 = !DILocation(line: 111, column: 35, scope: !311)
!324 = !DILocation(line: 111, column: 5, scope: !311)
!325 = !DILocation(line: 111, column: 18, scope: !311)
!326 = !DILocation(line: 111, column: 21, scope: !311)
!327 = !DILocation(line: 112, column: 35, scope: !311)
!328 = !DILocation(line: 112, column: 5, scope: !311)
!329 = !DILocation(line: 112, column: 18, scope: !311)
!330 = !DILocation(line: 112, column: 21, scope: !311)
!331 = !DILocation(line: 113, column: 35, scope: !311)
!332 = !DILocation(line: 113, column: 5, scope: !311)
!333 = !DILocation(line: 113, column: 18, scope: !311)
!334 = !DILocation(line: 113, column: 21, scope: !311)
!335 = !DILocation(line: 114, column: 34, scope: !311)
!336 = !DILocation(line: 114, column: 22, scope: !311)
!337 = !DILocation(line: 114, column: 37, scope: !311)
!338 = !DILocation(line: 114, column: 55, scope: !311)
!339 = !DILocation(line: 114, column: 43, scope: !311)
!340 = !DILocation(line: 114, column: 58, scope: !311)
!341 = !DILocation(line: 114, column: 41, scope: !311)
!342 = !DILocation(line: 114, column: 76, scope: !311)
!343 = !DILocation(line: 114, column: 64, scope: !311)
!344 = !DILocation(line: 114, column: 79, scope: !311)
!345 = !DILocation(line: 114, column: 62, scope: !311)
!346 = !DILocation(line: 114, column: 5, scope: !311)
!347 = !DILocation(line: 114, column: 18, scope: !311)
!348 = !DILocation(line: 114, column: 20, scope: !311)
!349 = !DILocation(line: 115, column: 3, scope: !311)
!350 = !DILocation(line: 117, column: 11, scope: !351)
!351 = distinct !DILexicalBlock(scope: !307, file: !3, line: 117, column: 11)
!352 = !DILocation(line: 117, column: 17, scope: !351)
!353 = !DILocation(line: 117, column: 11, scope: !307)
!354 = !DILocation(line: 119, column: 35, scope: !355)
!355 = distinct !DILexicalBlock(scope: !351, file: !3, line: 118, column: 3)
!356 = !DILocation(line: 119, column: 5, scope: !355)
!357 = !DILocation(line: 119, column: 18, scope: !355)
!358 = !DILocation(line: 119, column: 21, scope: !355)
!359 = !DILocation(line: 120, column: 35, scope: !355)
!360 = !DILocation(line: 120, column: 5, scope: !355)
!361 = !DILocation(line: 120, column: 18, scope: !355)
!362 = !DILocation(line: 120, column: 21, scope: !355)
!363 = !DILocation(line: 121, column: 35, scope: !355)
!364 = !DILocation(line: 121, column: 5, scope: !355)
!365 = !DILocation(line: 121, column: 18, scope: !355)
!366 = !DILocation(line: 121, column: 21, scope: !355)
