; ModuleID = '<stdin>'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Triangle_2D = type { i8, i8, i8, i8, i8, i8, i8 }
%struct.Triangle_3D = type { i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.CandidatePixel = type { i8, i8, i8, i8 }
%struct.Pixel = type { i8, i8, i8 }

@llvm.global_ctors = appending global [0 x { i32, void ()*, i8* }] zeroinitializer
@_ZZ8zcullingiP14CandidatePixeliP5PixelE8z_buffer = internal global [256 x [256 x i8]] zeroinitializer, align 1, !dbg !0

; Function Attrs: nounwind
define i32 @_Z15check_clockwise11Triangle_2D(%struct.Triangle_2D* byval align 1 %triangle_2d) #0 !dbg !41 {
entry:
  %cw = alloca i32, align 4
  call void @llvm.dbg.declare(metadata %struct.Triangle_2D* %triangle_2d, metadata !54, metadata !DIExpression()), !dbg !55
  %0 = bitcast i32* %cw to i8*, !dbg !56
  call void @llvm.lifetime.start.p0i8(i64 4, i8* %0) #13, !dbg !56
  call void @llvm.dbg.declare(metadata i32* %cw, metadata !57, metadata !DIExpression()), !dbg !58
  %x2 = getelementptr inbounds %struct.Triangle_2D, %struct.Triangle_2D* %triangle_2d, i32 0, i32 4, !dbg !59
  %1 = load i8, i8* %x2, align 1, !dbg !59
  %conv = zext i8 %1 to i32, !dbg !60
  %x0 = getelementptr inbounds %struct.Triangle_2D, %struct.Triangle_2D* %triangle_2d, i32 0, i32 0, !dbg !61
  %2 = load i8, i8* %x0, align 1, !dbg !61
  %conv1 = zext i8 %2 to i32, !dbg !62
  %sub = sub i32 %conv, %conv1, !dbg !63

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "z_buffer", scope: !2, file: !3, line: 196, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "zculling", linkageName: "_Z8zcullingiP14CandidatePixeliP5Pixel", scope: !3, file: !3, line: 193, type: !4, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!3 = !DIFile(filename: "benchmarks/rosetta/3d-rendering/src/rendering.cpp", directory: "/home/gabriel/Documents/UFRGS/RAISE/Approx")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7, !6, !18}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "CandidatePixel", file: !9, line: 55, baseType: !10)
!9 = !DIFile(filename: "benchmarks/rosetta/3d-rendering/src/typedefs.h", directory: "/home/gabriel/Documents/UFRGS/RAISE/Approx")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 49, size: 32, flags: DIFlagTypePassByValue, elements: !11, identifier: "_ZTS14CandidatePixel")
!11 = !{!12, !15, !16, !17}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !10, file: !9, line: 51, baseType: !13, size: 8)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "bit8", file: !9, line: 19, baseType: !14)
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !10, file: !9, line: 52, baseType: !13, size: 8, offset: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !10, file: !9, line: 53, baseType: !13, size: 8, offset: 16)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !10, file: !9, line: 54, baseType: !13, size: 8, offset: 24)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", file: !9, line: 63, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 58, size: 24, flags: DIFlagTypePassByValue, elements: !21, identifier: "_ZTS5Pixel")
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !9, line: 60, baseType: !13, size: 8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !9, line: 61, baseType: !13, size: 8, offset: 8)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !9, line: 62, baseType: !13, size: 8, offset: 16)
!25 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !26, producer: "clang version 7.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !28)
!26 = !DIFile(filename: "/home/gabriel/Documents/UFRGS/RAISE/Approx/raise_rendering/solution1/.autopilot/db/rendering.pp.0.cpp", directory: "/home/gabriel/Documents/UFRGS/RAISE/Approx")
!27 = !{}
!28 = !{!0, !29, !32}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!30 = distinct !DIGlobalVariable(name: "MAX_X", scope: !25, file: !9, line: 13, type: !31, isLocal: true, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!33 = distinct !DIGlobalVariable(name: "MAX_Y", scope: !25, file: !9, line: 14, type: !31, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 524288, elements: !35)
!35 = !{!36, !36}
!36 = !DISubrange(count: 256)
!37 = !{!"clang version 7.0.0 "}
!38 = !{i32 2, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = distinct !DISubprogram(name: "check_clockwise", linkageName: "_Z15check_clockwise11Triangle_2D", scope: !3, file: !3, line: 18, type: !42, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!42 = !DISubroutineType(types: !43)
!43 = !{!6, !44}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "Triangle_2D", file: !9, line: 46, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 37, size: 56, flags: DIFlagTypePassByValue, elements: !46, identifier: "_ZTS11Triangle_2D")
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !45, file: !9, line: 39, baseType: !13, size: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !45, file: !9, line: 40, baseType: !13, size: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !45, file: !9, line: 41, baseType: !13, size: 8, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !45, file: !9, line: 42, baseType: !13, size: 8, offset: 24)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !45, file: !9, line: 43, baseType: !13, size: 8, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !45, file: !9, line: 44, baseType: !13, size: 8, offset: 40)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !45, file: !9, line: 45, baseType: !13, size: 8, offset: 48)
!54 = !DILocalVariable(name: "triangle_2d", arg: 1, scope: !41, file: !3, line: 18, type: !44)
!55 = !DILocation(line: 18, column: 33, scope: !41)
!56 = !DILocation(line: 20, column: 3, scope: !41)
!57 = !DILocalVariable(name: "cw", scope: !41, file: !3, line: 20, type: !6)
!58 = !DILocation(line: 20, column: 7, scope: !41)
!59 = !DILocation(line: 22, column: 21, scope: !41)
!60 = !DILocation(line: 22, column: 9, scope: !41)
!61 = !DILocation(line: 22, column: 38, scope: !41)
!62 = !DILocation(line: 22, column: 26, scope: !41)
!63 = !DILocation(line: 22, column: 24, scope: !41)
!64 = !DILocation(line: 22, column: 57, scope: !41)
!65 = !DILocation(line: 22, column: 45, scope: !41)
!66 = !DILocation(line: 22, column: 74, scope: !41)
!67 = !DILocation(line: 22, column: 62, scope: !41)
!68 = !DILocation(line: 22, column: 60, scope: !41)
!69 = !DILocation(line: 22, column: 42, scope: !41)
!70 = !DILocation(line: 23, column: 23, scope: !41)
!71 = !DILocation(line: 23, column: 11, scope: !41)
!72 = !DILocation(line: 23, column: 40, scope: !41)
!73 = !DILocation(line: 23, column: 28, scope: !41)
!74 = !DILocation(line: 23, column: 26, scope: !41)
!75 = !DILocation(line: 23, column: 59, scope: !41)
!76 = !DILocation(line: 23, column: 47, scope: !41)
!77 = !DILocation(line: 23, column: 76, scope: !41)
!78 = !DILocation(line: 23, column: 64, scope: !41)
!79 = !DILocation(line: 23, column: 62, scope: !41)
!80 = !DILocation(line: 23, column: 44, scope: !41)
!81 = !DILocation(line: 23, column: 8, scope: !41)
!82 = !DILocation(line: 22, column: 6, scope: !41)
!83 = !DILocation(line: 25, column: 10, scope: !41)
!84 = !DILocation(line: 27, column: 1, scope: !41)
!85 = !DILocation(line: 25, column: 3, scope: !41)
!86 = distinct !DISubprogram(name: "clockwise_vertices", linkageName: "_Z18clockwise_verticesP11Triangle_2D", scope: !3, file: !3, line: 30, type: !87, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!90 = !DILocalVariable(name: "triangle_2d", arg: 1, scope: !86, file: !3, line: 30, type: !89)
!91 = !DILocation(line: 30, column: 38, scope: !86)
!92 = !DILocation(line: 32, column: 3, scope: !86)
!93 = !DILocalVariable(name: "tmp_x", scope: !86, file: !3, line: 32, type: !13)
!94 = !DILocation(line: 32, column: 8, scope: !86)
!95 = !DILocalVariable(name: "tmp_y", scope: !86, file: !3, line: 32, type: !13)
!96 = !DILocation(line: 32, column: 15, scope: !86)
!97 = !DILocation(line: 34, column: 11, scope: !86)
!98 = !DILocation(line: 34, column: 24, scope: !86)
!99 = !DILocation(line: 34, column: 9, scope: !86)
!100 = !DILocation(line: 35, column: 11, scope: !86)
!101 = !DILocation(line: 35, column: 24, scope: !86)
!102 = !DILocation(line: 35, column: 9, scope: !86)
!103 = !DILocation(line: 37, column: 21, scope: !86)
!104 = !DILocation(line: 37, column: 34, scope: !86)
!105 = !DILocation(line: 37, column: 3, scope: !86)
!106 = !DILocation(line: 37, column: 16, scope: !86)
!107 = !DILocation(line: 37, column: 19, scope: !86)
!108 = !DILocation(line: 38, column: 21, scope: !86)
!109 = !DILocation(line: 38, column: 34, scope: !86)
!110 = !DILocation(line: 38, column: 3, scope: !86)
!111 = !DILocation(line: 38, column: 16, scope: !86)
!112 = !DILocation(line: 38, column: 19, scope: !86)
!113 = !DILocation(line: 40, column: 21, scope: !86)
!114 = !DILocation(line: 40, column: 3, scope: !86)
!115 = !DILocation(line: 40, column: 16, scope: !86)
!116 = !DILocation(line: 40, column: 19, scope: !86)
!117 = !DILocation(line: 41, column: 21, scope: !86)
!118 = !DILocation(line: 41, column: 3, scope: !86)
!119 = !DILocation(line: 41, column: 16, scope: !86)
!120 = !DILocation(line: 41, column: 19, scope: !86)
!121 = !DILocation(line: 42, column: 1, scope: !86)
!122 = distinct !DISubprogram(name: "pixel_in_triangle", linkageName: "_Z17pixel_in_trianglehh11Triangle_2D", scope: !3, file: !3, line: 48, type: !123, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !13, !13, !44}
!125 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!126 = !DILocalVariable(name: "x", arg: 1, scope: !122, file: !3, line: 48, type: !13)
!127 = !DILocation(line: 48, column: 29, scope: !122)
!128 = !DILocalVariable(name: "y", arg: 2, scope: !122, file: !3, line: 48, type: !13)
!129 = !DILocation(line: 48, column: 37, scope: !122)
!130 = !DILocalVariable(name: "triangle_2d", arg: 3, scope: !122, file: !3, line: 48, type: !44)
!131 = !DILocation(line: 48, column: 52, scope: !122)
!132 = !DILocation(line: 50, column: 3, scope: !122)
!133 = !DILocalVariable(name: "pi0", scope: !122, file: !3, line: 50, type: !6)
!134 = !DILocation(line: 50, column: 7, scope: !122)
!135 = !DILocalVariable(name: "pi1", scope: !122, file: !3, line: 50, type: !6)
!136 = !DILocation(line: 50, column: 12, scope: !122)
!137 = !DILocalVariable(name: "pi2", scope: !122, file: !3, line: 50, type: !6)
!138 = !DILocation(line: 50, column: 17, scope: !122)
!139 = !DILocation(line: 52, column: 10, scope: !122)
!140 = !DILocation(line: 52, column: 26, scope: !122)
!141 = !DILocation(line: 52, column: 14, scope: !122)
!142 = !DILocation(line: 52, column: 12, scope: !122)
!143 = !DILocation(line: 52, column: 45, scope: !122)
!144 = !DILocation(line: 52, column: 33, scope: !122)
!145 = !DILocation(line: 52, column: 62, scope: !122)
!146 = !DILocation(line: 52, column: 50, scope: !122)
!147 = !DILocation(line: 52, column: 48, scope: !122)
!148 = !DILocation(line: 52, column: 30, scope: !122)
!149 = !DILocation(line: 52, column: 69, scope: !122)
!150 = !DILocation(line: 52, column: 85, scope: !122)
!151 = !DILocation(line: 52, column: 73, scope: !122)
!152 = !DILocation(line: 52, column: 71, scope: !122)
!153 = !DILocation(line: 52, column: 104, scope: !122)
!154 = !DILocation(line: 52, column: 92, scope: !122)
!155 = !DILocation(line: 52, column: 121, scope: !122)
!156 = !DILocation(line: 52, column: 109, scope: !122)
!157 = !DILocation(line: 52, column: 107, scope: !122)
!158 = !DILocation(line: 52, column: 89, scope: !122)
!159 = !DILocation(line: 52, column: 66, scope: !122)
!160 = !DILocation(line: 52, column: 7, scope: !122)
!161 = !DILocation(line: 53, column: 10, scope: !122)
!162 = !DILocation(line: 53, column: 26, scope: !122)
!163 = !DILocation(line: 53, column: 14, scope: !122)
!164 = !DILocation(line: 53, column: 12, scope: !122)
!165 = !DILocation(line: 53, column: 45, scope: !122)
!166 = !DILocation(line: 53, column: 33, scope: !122)
!167 = !DILocation(line: 53, column: 62, scope: !122)
!168 = !DILocation(line: 53, column: 50, scope: !122)
!169 = !DILocation(line: 53, column: 48, scope: !122)
!170 = !DILocation(line: 53, column: 30, scope: !122)
!171 = !DILocation(line: 53, column: 69, scope: !122)
!172 = !DILocation(line: 53, column: 85, scope: !122)
!173 = !DILocation(line: 53, column: 73, scope: !122)
!174 = !DILocation(line: 53, column: 71, scope: !122)
!175 = !DILocation(line: 53, column: 104, scope: !122)
!176 = !DILocation(line: 53, column: 92, scope: !122)
!177 = !DILocation(line: 53, column: 121, scope: !122)
!178 = !DILocation(line: 53, column: 109, scope: !122)
!179 = !DILocation(line: 53, column: 107, scope: !122)
!180 = !DILocation(line: 53, column: 89, scope: !122)
!181 = !DILocation(line: 53, column: 66, scope: !122)
!182 = !DILocation(line: 53, column: 7, scope: !122)
!183 = !DILocation(line: 54, column: 10, scope: !122)
!184 = !DILocation(line: 54, column: 26, scope: !122)
!185 = !DILocation(line: 54, column: 14, scope: !122)
!186 = !DILocation(line: 54, column: 12, scope: !122)
!187 = !DILocation(line: 54, column: 45, scope: !122)
!188 = !DILocation(line: 54, column: 33, scope: !122)
!189 = !DILocation(line: 54, column: 62, scope: !122)
!190 = !DILocation(line: 54, column: 50, scope: !122)
!191 = !DILocation(line: 54, column: 48, scope: !122)
!192 = !DILocation(line: 54, column: 30, scope: !122)
!193 = !DILocation(line: 54, column: 69, scope: !122)
!194 = !DILocation(line: 54, column: 85, scope: !122)
!195 = !DILocation(line: 54, column: 73, scope: !122)
!196 = !DILocation(line: 54, column: 71, scope: !122)
!197 = !DILocation(line: 54, column: 104, scope: !122)
!198 = !DILocation(line: 54, column: 92, scope: !122)
!199 = !DILocation(line: 54, column: 121, scope: !122)
!200 = !DILocation(line: 54, column: 109, scope: !122)
!201 = !DILocation(line: 54, column: 107, scope: !122)
!202 = !DILocation(line: 54, column: 89, scope: !122)
!203 = !DILocation(line: 54, column: 66, scope: !122)
!204 = !DILocation(line: 54, column: 7, scope: !122)
!205 = !DILocation(line: 56, column: 11, scope: !122)
!206 = !DILocation(line: 56, column: 15, scope: !122)
!207 = !DILocation(line: 56, column: 20, scope: !122)
!208 = !DILocation(line: 56, column: 23, scope: !122)
!209 = !DILocation(line: 56, column: 27, scope: !122)
!210 = !DILocation(line: 56, column: 32, scope: !122)
!211 = !DILocation(line: 56, column: 35, scope: !122)
!212 = !DILocation(line: 56, column: 39, scope: !122)
!213 = !DILocation(line: 57, column: 1, scope: !122)
!214 = !DILocation(line: 56, column: 3, scope: !122)
!215 = distinct !DISubprogram(name: "find_min", linkageName: "_Z8find_minhhh", scope: !3, file: !3, line: 60, type: !216, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!216 = !DISubroutineType(types: !217)
!217 = !{!13, !13, !13, !13}
!218 = !DILocalVariable(name: "in0", arg: 1, scope: !215, file: !3, line: 60, type: !13)
!219 = !DILocation(line: 60, column: 20, scope: !215)
!220 = !DILocalVariable(name: "in1", arg: 2, scope: !215, file: !3, line: 60, type: !13)
!221 = !DILocation(line: 60, column: 30, scope: !215)
!222 = !DILocalVariable(name: "in2", arg: 3, scope: !215, file: !3, line: 60, type: !13)
!223 = !DILocation(line: 60, column: 40, scope: !215)
!224 = !DILocation(line: 62, column: 7, scope: !225)
!225 = distinct !DILexicalBlock(scope: !215, file: !3, line: 62, column: 7)
!226 = !DILocation(line: 62, column: 13, scope: !225)
!227 = !DILocation(line: 62, column: 11, scope: !225)
!228 = !DILocation(line: 62, column: 7, scope: !215)
!229 = !DILocation(line: 64, column: 9, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 64, column: 9)
!231 = distinct !DILexicalBlock(scope: !225, file: !3, line: 63, column: 3)
!232 = !DILocation(line: 64, column: 15, scope: !230)
!233 = !DILocation(line: 64, column: 13, scope: !230)
!234 = !DILocation(line: 64, column: 9, scope: !231)
!235 = !DILocation(line: 65, column: 14, scope: !230)
!236 = !DILocation(line: 65, column: 7, scope: !230)
!237 = !DILocation(line: 67, column: 14, scope: !230)
!238 = !DILocation(line: 67, column: 7, scope: !230)
!239 = !DILocation(line: 71, column: 9, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 71, column: 9)
!241 = distinct !DILexicalBlock(scope: !225, file: !3, line: 70, column: 3)
!242 = !DILocation(line: 71, column: 15, scope: !240)
!243 = !DILocation(line: 71, column: 13, scope: !240)
!244 = !DILocation(line: 71, column: 9, scope: !241)
!245 = !DILocation(line: 72, column: 14, scope: !240)
!246 = !DILocation(line: 72, column: 7, scope: !240)
!247 = !DILocation(line: 74, column: 14, scope: !240)
!248 = !DILocation(line: 74, column: 7, scope: !240)
!249 = !DILocation(line: 76, column: 1, scope: !215)
!250 = distinct !DISubprogram(name: "find_max", linkageName: "_Z8find_maxhhh", scope: !3, file: !3, line: 79, type: !216, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!251 = !DILocalVariable(name: "in0", arg: 1, scope: !250, file: !3, line: 79, type: !13)
!252 = !DILocation(line: 79, column: 20, scope: !250)
!253 = !DILocalVariable(name: "in1", arg: 2, scope: !250, file: !3, line: 79, type: !13)
!254 = !DILocation(line: 79, column: 30, scope: !250)
!255 = !DILocalVariable(name: "in2", arg: 3, scope: !250, file: !3, line: 79, type: !13)
!256 = !DILocation(line: 79, column: 40, scope: !250)
!257 = !DILocation(line: 81, column: 7, scope: !258)
!258 = distinct !DILexicalBlock(scope: !250, file: !3, line: 81, column: 7)
!259 = !DILocation(line: 81, column: 13, scope: !258)
!260 = !DILocation(line: 81, column: 11, scope: !258)
!261 = !DILocation(line: 81, column: 7, scope: !250)
!262 = !DILocation(line: 83, column: 9, scope: !263)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 83, column: 9)
!264 = distinct !DILexicalBlock(scope: !258, file: !3, line: 82, column: 3)
!265 = !DILocation(line: 83, column: 15, scope: !263)
!266 = !DILocation(line: 83, column: 13, scope: !263)
!267 = !DILocation(line: 83, column: 9, scope: !264)
!268 = !DILocation(line: 84, column: 14, scope: !263)
!269 = !DILocation(line: 84, column: 7, scope: !263)
!270 = !DILocation(line: 86, column: 14, scope: !263)
!271 = !DILocation(line: 86, column: 7, scope: !263)
!272 = !DILocation(line: 90, column: 9, scope: !273)
!273 = distinct !DILexicalBlock(scope: !274, file: !3, line: 90, column: 9)
!274 = distinct !DILexicalBlock(scope: !258, file: !3, line: 89, column: 3)
!275 = !DILocation(line: 90, column: 15, scope: !273)
!276 = !DILocation(line: 90, column: 13, scope: !273)
!277 = !DILocation(line: 90, column: 9, scope: !274)
!278 = !DILocation(line: 91, column: 14, scope: !273)
!279 = !DILocation(line: 91, column: 7, scope: !273)
!280 = !DILocation(line: 93, column: 14, scope: !273)
!281 = !DILocation(line: 93, column: 7, scope: !273)
!282 = !DILocation(line: 95, column: 1, scope: !250)
!283 = distinct !DISubprogram(name: "projection", linkageName: "_Z10projection11Triangle_3DP11Triangle_2Di", scope: !3, file: !3, line: 100, type: !284, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !25, variables: !27)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !286, !89, !6}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "Triangle_3D", file: !9, line: 34, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 23, size: 72, flags: DIFlagTypePassByValue, elements: !288, identifier: "_ZTS11Triangle_3D")
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "x0", scope: !287, file: !9, line: 25, baseType: !13, size: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !287, file: !9, line: 26, baseType: !13, size: 8, offset: 8)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "z0", scope: !287, file: !9, line: 27, baseType: !13, size: 8, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !287, file: !9, line: 28, baseType: !13, size: 8, offset: 24)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !287, file: !9, line: 29, baseType: !13, size: 8, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "z1", scope: !287, file: !9, line: 30, baseType: !13, size: 8, offset: 40)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !287, file: !9, line: 31, baseType: !13, size: 8, offset: 48)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !287, file: !9, line: 32, baseType: !13, size: 8, offset: 56)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "z2", scope: !287, file: !9, line: 33, baseType: !13, size: 8, offset: 64)
!298 = !DILocalVariable(name: "triangle_3d", arg: 1, scope: !283, file: !3, line: 100, type: !286)
!299 = !DILocation(line: 100, column: 29, scope: !283)
!300 = !DILocalVariable(name: "triangle_2d", arg: 2, scope: !283, file: !3, line: 100, type: !89)
!301 = !DILocation(line: 100, column: 55, scope: !283)
!302 = !DILocalVariable(name: "angle", arg: 3, scope: !283, file: !3, line: 100, type: !6)
!303 = !DILocation(line: 100, column: 72, scope: !283)
!304 = !DILocation(line: 106, column: 6, scope: !305)
!305 = distinct !DILexicalBlock(scope: !283, file: !3, line: 106, column: 6)
!306 = !DILocation(line: 106, column: 12, scope: !305)
!307 = !DILocation(line: 106, column: 6, scope: !283)
!308 = !DILocation(line: 108, column: 35, scope: !309)
!309 = distinct !DILexicalBlock(scope: !305, file: !3, line: 107, column: 3)
!310 = !DILocation(line: 108, column: 5, scope: !309)
!311 = !DILocation(line: 108, column: 18, scope: !309)
!312 = !DILocation(line: 108, column: 21, scope: !309)
!313 = !DILocation(line: 109, column: 35, scope: !309)
!314 = !DILocation(line: 109, column: 5, scope: !309)
!315 = !DILocation(line: 109, column: 18, scope: !309)
!316 = !DILocation(line: 109, column: 21, scope: !309)
!317 = !DILocation(line: 110, column: 35, scope: !309)
!318 = !DILocation(line: 110, column: 5, scope: !309)
!319 = !DILocation(line: 110, column: 18, scope: !309)
!320 = !DILocation(line: 110, column: 21, scope: !309)
!321 = !DILocation(line: 111, column: 35, scope: !309)
!322 = !DILocation(line: 111, column: 5, scope: !309)
!323 = !DILocation(line: 111, column: 18, scope: !309)
!324 = !DILocation(line: 111, column: 21, scope: !309)
!325 = !DILocation(line: 112, column: 35, scope: !309)
!326 = !DILocation(line: 112, column: 5, scope: !309)
!327 = !DILocation(line: 112, column: 18, scope: !309)
!328 = !DILocation(line: 112, column: 21, scope: !309)
!329 = !DILocation(line: 113, column: 35, scope: !309)
!330 = !DILocation(line: 113, column: 5, scope: !309)
!331 = !DILocation(line: 113, column: 18, scope: !309)
!332 = !DILocation(line: 113, column: 21, scope: !309)
!333 = !DILocation(line: 114, column: 34, scope: !309)
!334 = !DILocation(line: 114, column: 22, scope: !309)
!335 = !DILocation(line: 114, column: 37, scope: !309)
!336 = !DILocation(line: 114, column: 55, scope: !309)
!337 = !DILocation(line: 114, column: 43, scope: !309)
!338 = !DILocation(line: 114, column: 58, scope: !309)
!339 = !DILocation(line: 114, column: 41, scope: !309)
!340 = !DILocation(line: 114, column: 76, scope: !309)
!341 = !DILocation(line: 114, column: 64, scope: !309)
!342 = !DILocation(line: 114, column: 79, scope: !309)
!343 = !DILocation(line: 114, column: 62, scope: !309)
!344 = !DILocation(line: 114, column: 5, scope: !309)
!345 = !DILocation(line: 114, column: 18, scope: !309)
!346 = !DILocation(line: 114, column: 20, scope: !309)
!347 = !DILocation(line: 115, column: 3, scope: !309)
!348 = !DILocation(line: 117, column: 11, scope: !349)
!349 = distinct !DILexicalBlock(scope: !305, file: !3, line: 117, column: 11)
!350 = !DILocation(line: 117, column: 17, scope: !349)
!351 = !DILocation(line: 117, column: 11, scope: !305)
!352 = !DILocation(line: 119, column: 35, scope: !353)
!353 = distinct !DILexicalBlock(scope: !349, file: !3, line: 118, column: 3)
!354 = !DILocation(line: 119, column: 5, scope: !353)
!355 = !DILocation(line: 119, column: 18, scope: !353)
!356 = !DILocation(line: 119, column: 21, scope: !353)
!357 = !DILocation(line: 120, column: 35, scope: !353)
!358 = !DILocation(line: 120, column: 5, scope: !353)
!359 = !DILocation(line: 120, column: 18, scope: !353)
!360 = !DILocation(line: 120, column: 21, scope: !353)
!361 = !DILocation(line: 121, column: 35, scope: !353)
!362 = !DILocation(line: 121, column: 5, scope: !353)
!363 = !DILocation(line: 121, column: 18, scope: !353)
!364 = !DILocation(line: 121, column: 21, scope: !353)
